ams/src/Documents/AMS_ОбъединеннаяЗагрузка/AMS_ОбъединеннаяЗагрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ОбъединеннаяЗагрузка</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обрешетка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Реализации</name>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Enums/AMS_СтатусыРеализаций/AMS_СтатусыРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыРеализаций</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Стикерование</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоРаспискеЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов_УПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоУПДестьТНнет</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаБезДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ_12_Удалить</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>_АртикулКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_АртикулКлиентаПлюс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзАктОРасхождениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзСпецификация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзСЧ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзТТН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзТОРГ12</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_КолЭкзУПД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Стикерование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_ПорядокКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслугаСпособ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслугаПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ТранпортнаяУслугаСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ШтрихКодЕдиницы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>_ШтрихКодУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AMS_СегментРынка</name>
    <type>
      <types>CatalogRef.AMS_СегментыРынка</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Documents/AMS_ОбъединеннаяЗагрузка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ТекущийОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		Если ПустаяСтрока(ТекущийОбъект.АдресДоставки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле ""Адрес доставки"" не заполнено", , , , Отказ);
		КонецЕсли;

		Если ТекущийОбъект.ВремяДоставкиС = Дата(1, 1, 1) Тогда
			ОбщегоНазначения.СообщитьПользователю("Поле ""Время доставки С"" не заполнено", , , , Отказ);
		КонецЕсли;
	КонецЕсли;

	Если ТекущийОбъект.Реализации.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет документов реализации для объединения", , , , Отказ);
	ИначеЕсли ТекущийОбъект.Реализации.Количество() = 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Указан только один документ реализации", , , , Отказ);
	КонецЕсли;

	Если Не Отказ Тогда
		Реализации = ТекущийОбъект.Реализации;
		ТекущийОбъект.СуммаДокумента = Реализации.Итог("СуммаДокумента");
		ТекущийОбъект.AMS_Вес           = Реализации.Итог("Вес");
		ТекущийОбъект.AMS_Объем         = Реализации.Итог("Объем");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ОбъединеннаяЗагрузка", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОчиститьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Парам = Новый Структура;
	Парам.Вставить("Дата", Объект.Дата);
	Парам.Вставить("ОбъединеннаяЗагрузка", Объект.Ссылка);

	ОткрытьФорму("Документ.AMS_ОбъединеннаяЗагрузка.Форма.ФормаВыбораКлиента", Парам, , , , ,
		Новый ОписаниеОповещения("ОткрытьФормуВыбораКлиентаЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеализации

&НаКлиенте
Процедура РеализацииПослеУдаления(Элемент)
	ЗаполнитьПалетыРасчет();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	Парам = Новый Структура;
	Парам.Вставить("Дата", Объект.Дата);
	Парам.Вставить("Партнер", Объект.Партнер);
	Парам.Вставить("СпособДоставки", Объект.СпособДоставки);
	Парам.Вставить("ВремяДоставкиС", Объект.ВремяДоставкиС);
	Парам.Вставить("АдресДоставки", Объект.АдресДоставки);
	Парам.Вставить("МассивРеализаций", ПолучитьМассивРеализаций());

	ОткрытьФорму("Документ.AMS_ОбъединеннаяЗагрузка.Форма.ФормаВыбораРеализации", Парам, , , , ,
		Новый ОписаниеОповещения("ОткрытьФормуВыбораРеализацииЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	// Если документ включён в логистический лист, то его изменения запретить
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Распоряжение", Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Распоряжение = &Распоряжение";
	ЕстьТранспортДоставки = Не Запрос.Выполнить().Пустой();

	ТолькоПросмотр = ЕстьТранспортДоставки;

	Элементы.ГруппаКнопки.Видимость = Не ЕстьТранспортДоставки;
	
	// Расчет итогов
	Сумма        = 0;
	Палеты       = 0;
	ПалетыРасчет = 0;
	Вес          = 0;
	Объем        = 0;

	Табл = Объект.Реализации;
	Для Каждого Стр Из Табл Цикл
		Док = Стр.Реализация;

		ДанныеДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док, "СуммаДокумента,AMS_КоличествоПалет,AMS_Вес,AMS_Объем");

		Сумма  = Сумма + ДанныеДок.СуммаДокумента;
		Палеты = Палеты + ДанныеДок.AMS_КоличествоПалет;
		Вес    = Вес + ДанныеДок.AMS_Вес;
		Объем  = Объем + ДанныеДок.AMS_Объем;

		Если ЗначениеЗаполнено(Док) Тогда
			Стр.ПалетыРасчет = AMS_Сервер.ПолучитьВесОбъемТоваров(мср.ПолучитьРеализацияТовары(Док)).КоличествоПалет;
		КонецЕсли;

		ПалетыРасчет = ПалетыРасчет + Стр.ПалетыРасчет;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОчиститьДокумент()
	Объект.Партнер          = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
	Объект.СпособДоставки   = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ПустаяСсылка");
	Объект.ЗонаДоставки     = Неопределено;
	Объект.АдресДоставки    = "";
	Объект.ВремяДоставкиС   = Дата(1, 1, 1);
	Объект.ВремяДоставкиПо  = Дата(1, 1, 1);
	Объект.АдресДоставки    = "";
	Объект.УсловияОтгрузки  = "";
	Объект.ОсобыеУсловияПеревозкиОписание = "";
	Объект.СуммаДокумента   = 0;
	Объект.AMS_КоличествоПалет = 0;
	Объект.AMS_Вес             = 0;
	Объект.AMS_Объем           = 0;

	Объект.Реализации.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКлиентаЗавершение(ВыбранныйЭлемент, СписокПараметров) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.Реализации.Очистить();

	ЗаполнитьЗначенияСвойств(Объект, ВыбранныйЭлемент);

	ЗаполнитьДокумент();

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("СпособДоставки", Объект.СпособДоставки);
	Запрос.УстановитьПараметр("СпособПередачиТоваров", Объект.СпособПередачиТоваров);
	Запрос.УстановитьПараметр("Обрешетка", Объект.Обрешетка);
	Запрос.УстановитьПараметр("ВремяДоставкиС", Объект.ВремяДоставкиС);
	Запрос.УстановитьПараметр("АдресДоставки", Объект.АдресДоставки);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	д.Ссылка КАК Реализация,
	|	д.AMS_КоличествоПалет КАК КоличествоПалет,
	|	д.AMS_Вес КАК Вес,
	|	д.AMS_Объем КАК Объем,
	|	д.СуммаДокумента КАК СуммаДокумента,
	|	д.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	д.AMS_УсловияОтгрузки КАК УсловияОтгрузки,
	|	д.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК д
	|ГДЕ
	|	д.Проведен
	|	И д.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|	И д.Партнер = &Партнер
	|	И д.СпособДоставки = &СпособДоставки
	|	И д.ВремяДоставкиС = &ВремяДоставкиС
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ВЫБОР
	|		КОГДА д.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА д.АдресДоставкиПеревозчика = &АдресДоставки
	|		ИНАЧЕ д.АдресДоставки = &АдресДоставки
	|	КОНЕЦ
	|	И д.AMS_СпособПередачиТоваров = &СпособПередачиТоваров
	|	И д.AMS_Обрешетка = &Обрешетка
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.Номер";

	Рез = Запрос.Выполнить();

	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выб = Рез.Выбрать();

	УсловияОтгрузки = "";
	ВремяДоставкиПо = '00010101000000';
	ОсобыеУсловияПеревозкиОписание = "";

	Реализации = Объект.Реализации;
	Реализации.Очистить();

	Пока Выб.Следующий() Цикл
		Стр = Реализации.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Выб);

		Если Не УсловияОтгрузки = Выб.УсловияОтгрузки Тогда
			УсловияОтгрузки = УсловияОтгрузки + Выб.УсловияОтгрузки + ", ";
		КонецЕсли;

		Если Не ОсобыеУсловияПеревозкиОписание = Выб.ОсобыеУсловияПеревозкиОписание Тогда
			ОсобыеУсловияПеревозкиОписание = ОсобыеУсловияПеревозкиОписание + Выб.ОсобыеУсловияПеревозкиОписание + ", ";
		КонецЕсли;

		Если ВремяДоставкиПо < Выб.ВремяДоставкиПо Тогда
			ВремяДоставкиПо = Выб.ВремяДоставкиПо;
		КонецЕсли;
	КонецЦикла;

	Объект.ВремяДоставкиПо = ВремяДоставкиПо;
	Объект.УсловияОтгрузки = Лев(УсловияОтгрузки, СтрДлина(УсловияОтгрузки) - 2);
	Объект.ОсобыеУсловияПеревозкиОписание = Лев(ОсобыеУсловияПеревозкиОписание, СтрДлина(ОсобыеУсловияПеревозкиОписание)
		- 2);

	ЗаполнитьПалетыРасчет();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРеализацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Табл = Объект.Реализации;

	Стр = Табл.Добавить();

	ЗаполнитьЗначенияСвойств(Стр, Результат);

	Если Объект.ВремяДоставкиПо < Результат.ВремяДоставкиПо Тогда
		Объект.ВремяДоставкиПо = Результат.ВремяДоставкиПо;
	КонецЕсли
	;

	Если Не Объект.Обрешетка = Результат.Обрешетка Тогда
		Объект.Обрешетка = Результат.Обрешетка;
	КонецЕсли
	;

	Если Не Объект.СпособПередачиТоваров = Результат.СпособПередачиТоваров Тогда
		Объект.Обрешетка = Результат.Обрешетка;
	КонецЕсли
	;

	Если Не Объект.УсловияОтгрузки = Результат.УсловияОтгрузки Тогда
		Объект.УсловияОтгрузки = ?(ПустаяСтрока(Объект.УсловияОтгрузки), Результат.УсловияОтгрузки,
			Объект.УсловияОтгрузки + ", " + Результат.УсловияОтгрузки);
	КонецЕсли;

	Если Не Объект.ОсобыеУсловияПеревозкиОписание = Результат.ОсобыеУсловияПеревозкиОписание Тогда
		Объект.ОсобыеУсловияПеревозкиОписание = ?(ПустаяСтрока(Объект.ОсобыеУсловияПеревозкиОписание),
			Результат.ОсобыеУсловияПеревозкиОписание, Объект.ОсобыеУсловияПеревозкиОписание + ", "
			+ Результат.ОсобыеУсловияПеревозкиОписание);
	КонецЕсли;

	Объект.СуммаДокумента = Табл.Итог("СуммаДокумента");
	Объект.AMS_КоличествоПалет = Табл.Итог("КоличествоПалет");
	Объект.AMS_Вес = Табл.Итог("Вес");
	Объект.AMS_Объем = Табл.Итог("Объем");

	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРеализаций()
	Возврат Объект.Реализации.Выгрузить().ВыгрузитьКолонку("Реализация");
КонецФункции

&НаСервере
Процедура ЗаполнитьПалетыРасчет()
	ПалетыРасчет    = 0;
	Табл = Объект.Реализации;
	Для Каждого Стр Из Табл Цикл
		Док = Стр.Реализация;
		Если ЗначениеЗаполнено(Док) Тогда
			Стр.ПалетыРасчет = AMS_Сервер.ПолучитьВесОбъемТоваров(мср.ПолучитьРеализацияТовары(Док)).КоличествоПалет;
			ПалетыРасчет = ПалетыРасчет + Стр.ПалетыРасчет;
		Иначе
			Стр.ПалетыРасчет = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
